In [70]:
import pandas as pd
import numpy as np

# Machine learning algorithm
from sklearn.ensemble import RandomForestClassifier

# Test-trian split-> around 30/70
from sklearn.model_selection import train_test_split

# Switch off pandas warning
pd.options.mode.chained_assignment = None

# Write model to our file (to save it)
from joblib import dump, load

# import normalizer
from sklearn.preprocessing import Normalizer

In [71]:
path  = r"C:\Users\14165\Dev\Dev_data\Titanic-Machine-Learning-master\titanic_train.csv"
data = pd.read_csv(path)
data.head()

,Unnamed: 0,row.names,pclass,survived,name,age,embarked,home.dest,room,ticket,boat,sex
0,998,999,3rd,1,"McCarthy, Miss Katie",NaN,NaN,NaN,NaN,NaN,NaN,female
1,179,180,1st,0,"Millet, Mr Francis Davis",65.0,Southampton,"East Bridgewater, MA",NaN,NaN,(249),male
2,556,557,2nd,0,"Sjostedt, Mr Ernst Adolf",59.0,Southampton,"Sault St Marie, ON",NaN,NaN,NaN,male
3,174,175,1st,0,"McCaffry, Mr Thomas Francis",46.0,Cherbourg,"Vancouver, BC",NaN,NaN,(292),male
4,1232,1233,3rd,0,"Strilic, Mr Ivan",NaN,NaN,NaN,NaN,NaN,NaN,male

In [72]:
mean_age = data["age"].mean()
print(mean_age)

31.063591343963555

In [73]:
data["age"].fillna(mean_age, inplace =  True)
data["age"].head()

0    31.063591
1    65.000000
2    59.000000
3    46.000000
4    31.063591
Name: age, dtype: float64

In [74]:
data_input = data[["pclass", "age", "sex"]]
data_input.head()

  pclass        age     sex
0    3rd  31.063591  female
1    1st  65.000000    male
2    2nd  59.000000    male
3    1st  46.000000    male
4    3rd  31.063591    male

In [75]:
expected_output = data["survived"]
expected_output.head()

0    1
1    0
2    0
3    0
4    0
Name: survived, dtype: int64

In [76]:
# change pclass from str to int
pclasses = {1: "1st", 2: "2nd", 3: "3rd"}
for new_class in pclasses:
    data_input["pclass"].replace(pclasses[new_class], new_class, inplace = True)
data_input.head()

   pclass        age     sex
0       3  31.063591  female
1       1  65.000000    male
2       2  59.000000    male
3       1  46.000000    male
4       3  31.063591    male

In [77]:
# change sex: female = 0 male = 1
data_input["sex"] = np.where(data_input["sex"] == "female", 0, 1)
data_input.head()

   pclass        age  sex
0       3  31.063591    0
1       1  65.000000    1
2       2  59.000000    1
3       1  46.000000    1
4       3  31.063591    1

In [78]:
# test data normalization
d_normalizer = Normalizer(norm = "l1").fit(data_input.values)
data_normalized = d_normalizer.transform(data_input.values)
data_input = pd.DataFrame(data_normalized, columns = ["pclass", "age", "sex"])
data_input.head()

     pclass       age       sex
0  0.088071  0.911929  0.000000
1  0.014925  0.970149  0.014925
2  0.032258  0.951613  0.016129
3  0.020833  0.958333  0.020833
4  0.085559  0.885922  0.028520

In [79]:
input_train, input_test, output_train, output_test = train_test_split(data_input, expected_output, test_size = 0.30, random_state = 42)

In [80]:
rf = RandomForestClassifier(n_estimators = 100)

In [81]:
rf.fit(input_train, output_train)

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=None, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=100,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [82]:
accuracy = rf.score(input_test, output_test)
print(f"Accuracy is {round(accuracy * 100)}")

Accuracy is 78.0

In [83]:
dump(rf, "titanic_model1", compress=9)

['titanic_model1']